validation/solid/constBurn/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState rhoConst;
    specie          specie;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   34.2;
    }

    transport
    {
        kappa   0.2;
    }

    thermodynamics
    {
        Hf      0.;
        Cp      1400.;
    }

    equationOfState
    {
        rho     1800.;
    }
}


// ************************************************************************* //
